# 문제1: 1

# 문제2-a: 29번
# 문제2-b: 3번

# 문제3:
# for i in range(6):
#     print("Hello")

# 문제4: 0, 10, 2 가 출력된다.

# 문제5:
# i = 10
# sum = 0
# while i > 0:
#     sum += 1
#     i -= 1

# 문제6: 
# sum = 0
# for i in range(0,100000):
#     sum += 1

# 문제7: Hello World!가 6번 출력된다.

# 문제8: 0이 무한이 출력된다.

# 문제9: 'Hi !'가 11한 번 출력된다.

# 문제10: 2, 4, 6, 8 이 출력된다.

# 문제11: 
# 첫 번째 반복 때, digit에 n의 값 1234를 10으로 나눈 나머지값 4가 저장되고 그것이 sum에 저장된다. 
#   이후 n의 값은 10으로 정수 나눗셈을 하여 123이 된다.
# 두 번째 반복 때, digit에 n의 값 123를 10으로 나눈 나머지값 3이 저장되고 그것이 sum에 저장된다. 
#   이후 n의 값은 10으로 정수 나눗셈을 하여 12가 된다.
# 세 번째 반복 때, digit에 n의 값 12를 10으로 나눈 나머지값 2가 저장되고 그것이 sum에 저장된다. 
#   이후 n의 값은 10으로 정수 나눗셈을 하여 1이 된다.
# 네 번째 반복 때, digit에 n의 값 1를 10으로 나눈 나머지값 1가 저장되고 그것이 sum에 저장된다. 
#   이후 n의 값은 10으로 정수 나눗셈을 하여 0이 된다.
# 다섯 번째 반복에서 조건이 거짓이 되어 끝나고 sum의 값 10이 출력된다.

# 문제12: 1000000

# 문제13: 
        # 10 TV
        # 10 Phone
        # 20 TV
        # 20 Phone
